<a href="https://colab.research.google.com/github/ValdazoAmerico/Support-Vector-Regression/blob/main/Support_Vector_Regression.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [ ]:
import pandas as pd
import numpy as np
import seaborn as sns
sns.get_dataset_names()

['anagrams',
 'anscombe',
 'attention',
 'brain_networks',
 'car_crashes',
 'diamonds',
 'dots',
 'exercise',
 'flights',
 'fmri',
 'gammas',
 'geyser',
 'iris',
 'mpg',
 'penguins',
 'planets',
 'tips',
 'titanic']

In [ ]:
tips_df = sns.load_dataset("tips")

In [ ]:
tips_df.head()

   total_bill   tip     sex smoker  day    time  size
0       16.99  1.01  Female     No  Sun  Dinner     2
1       10.34  1.66    Male     No  Sun  Dinner     3
2       21.01  3.50    Male     No  Sun  Dinner     3
3       23.68  3.31    Male     No  Sun  Dinner     2
4       24.59  3.61  Female     No  Sun  Dinner     4

In [ ]:
X = tips_df.drop(['tip'], axis=1)
y = tips_df['tip']

X.head()

   total_bill     sex smoker  day    time  size
0       16.99  Female     No  Sun  Dinner     2
1       10.34    Male     No  Sun  Dinner     3
2       21.01    Male     No  Sun  Dinner     3
3       23.68    Male     No  Sun  Dinner     2
4       24.59  Female     No  Sun  Dinner     4

In [ ]:
y.head()

0    1.01
1    1.66
2    3.50
3    3.31
4    3.61
Name: tip, dtype: float64

In [ ]:
##Eliminamos variables categoricas
numerical = X.drop(['sex', 'smoker', 'day', 'time'], axis=1)

In [ ]:
##Solo tenemos las variables numéricas
numerical.head()

   total_bill  size
0       16.99     2
1       10.34     3
2       21.01     3
3       23.68     2
4       24.59     4

In [ ]:
##Guardamos las variables categoricas en una variable que se llama categorical
categorical = X.filter(['sexi', 'smoker','day','time'])
categorical.head()

  smoker  day    time
0     No  Sun  Dinner
1     No  Sun  Dinner
2     No  Sun  Dinner
3     No  Sun  Dinner
4     No  Sun  Dinner

In [ ]:
##Convertimos las variables categoricas en numéricas mediante codificación one-hot
import pandas as pd
cat_numerical = pd.get_dummies(categorical,drop_first=True)
cat_numerical.head()

   smoker_No  day_Fri  day_Sat  day_Sun  time_Dinner
0          1        0        0        1            1
1          1        0        0        1            1
2          1        0        0        1            1
3          1        0        0        1            1
4          1        0        0        1            1

In [ ]:
##Concatenamos los dataframes y obbtenemos uno solo con datos numéricos
X = pd.concat([numerical, cat_numerical], axis=1)
X.head()

   total_bill  size  smoker_No  day_Fri  day_Sat  day_Sun  time_Dinner
0       16.99     2          1        0        0        1            1
1       10.34     3          1        0        0        1            1
2       21.01     3          1        0        0        1            1
3       23.68     2          1        0        0        1            1
4       24.59     4          1        0        0        1            1

In [ ]:
X.dtypes

total_bill     float64
size             int64
smoker_No        uint8
day_Fri          uint8
day_Sat          uint8
day_Sun          uint8
time_Dinner      uint8
dtype: object

In [ ]:
##Dividimos los datos en conjuntos de prueba y entrenamiento
from sklearn.model_selection import train_test_split
X_train, X_test, y_train, y_test = train_test_split(X, y, test_size=0.20, random_state=0)

In [ ]:
from sklearn.preprocessing import StandardScaler
sc = StandardScaler()
X_train = sc.fit_transform(X_train)
X_test = sc.transform(X_test)

In [ ]:
##Support Vector Regression
from sklearn import svm
svm_reg = svm.SVR()

regressor = svm_reg.fit(X_train, y_train)
y_pred = regressor.predict(X_test)

In [ ]:
from sklearn import metrics

print("Mean Absolute Error:", metrics.mean_absolute_error(y_test,y_pred))
print("Mean Squared Error:", metrics.mean_squared_error(y_test, y_pred))
print("Root Mean Squared Error", np.sqrt(metrics.mean_squared_error(y_test,y_pred)))

Mean Absolute Error: 0.719498473907601
Mean Squared Error: 0.9804828095791965
Root Mean Squared Error 0.990193319296387